# Assignment 2 (Week 2)

>**Note**: Late submissions are ***`penalized`***.

## Name: Ifeoluwa Oduwaiye

In [1]:
import pandas as pd
import sqlite3

In [2]:
%load_ext sql

In [3]:
%%sql

sqlite:///week_2.db

'Connected: @week_2.db'

### The Database can be found [here](https://drive.google.com/file/d/1uIPkJWIHyZ8iQD_tQlM_K-ANoT_Bpy8P/view?usp=sharing)

> Run the command below to see all the tables present in the SQLite DB.

```sql
SELECT name FROM sqlite_master;
```

<hr>
<br>

In [4]:
%%sql

SELECT name from sqlite_master;

 * sqlite:///week_2.db
Done.

[('customers',),
 ('sqlite_sequence',),
 ('orders',),
 ('employee',),
 ('department',),
 ('students',),
 ('sqlite_autoindex_students_1',),
 ('products',)]

## Qs 1: 

a. Given the table, `customers` and `orders` shown below, use a **subquery** to find the **customers** that did ***NOT*** place any orders. Display only the customer name(s).

**`customers`**

![image.png](https://i.postimg.cc/sx2WK6v3/image.png)


**`orders`**

![image.png](https://i.postimg.cc/T2H5fcKW/image.png)

b. Given the `products` table shown below:

[![image.png](https://i.postimg.cc/W18dpLXC/image.png)](https://postimg.cc/DSWv5DVP)

write a query that returns the price of each product at every store. Your result should look like this:

[![image.png](https://i.postimg.cc/s235K4Nd/image.png)](https://postimg.cc/FYnfH3vD)

**Hint:** Use `CASE` statement.

### NOTE: You must use a single query.

In [ ]:
# Write your solution here

In [5]:
%%sql

SELECT id,
CASE WHEN store = 'store a' THEN SUM(price)
END AS 'store a'
FROM products

 * sqlite:///week_2.db
(sqlite3.OperationalError) near "FROM": syntax error
[SQL: SELECT (SUM(price) FROM products WHERE store = 'store a')
FROM products]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

## Qs 2: 

Given the tables `employee` and `department` shown below:

![image.png](https://i.postimg.cc/bw0J574p/image.png)

a. Write a query that generates the table shown below:

![image](https://i.postimg.cc/hjc3rdTK/image.pnghttps://i.postimg.cc/hjc3rdTK/image.png)

b. Write a query that determines the **highest earner** in **each department**.

c. Write a query that shows all the employees in each department **except** the **lowest earner**. i.e generate the table below

![image.png](https://i.postimg.cc/MHcmw7Q0/image.png)

In [ ]:
# Write your solution here
%%sql

SELECT name, salary, dept_name
FROM employee JOIN department
ON employee.dept_id = department.id
ORDER BY dept_name

   sqlite:////content/week_2
   sqlite:///week_2
 * sqlite:///week_2.db
Done.

[('Felix', 33000, 'IT'),
 ('Okafor', 25000, 'IT'),
 ('Gafar', 41000, 'IT'),
 ('Amanda', 53000, 'IT'),
 ('Steve', 32000, 'Sales'),
 ('Bola', 31000, 'Sales'),
 ('Babalola', 30200, 'Sales'),
 ('Adigun', 30000, 'Sales')]

In [ ]:
# Write your solution here

%%sql

SELECT name, salary, dept_name
FROM employee JOIN department
ON employee.dept_id = department.id
WHERE salary IN (SELECT MAX(salary)
FROM employee
GROUP BY dept_id)
ORDER BY dept_name

   sqlite:////content/week_2
   sqlite:///week_2
 * sqlite:///week_2.db
Done.

[('Amanda', 53000, 'IT'), ('Steve', 32000, 'Sales')]

In [ ]:
# Write your solution here

%%sql

SELECT name, salary, dept_name
FROM employee JOIN department
ON employee.dept_id = department.id
WHERE salary NOT IN (SELECT MIN(salary)
FROM employee
GROUP BY dept_id)
ORDER BY salary DESC

   sqlite:////content/week_2
   sqlite:///week_2
 * sqlite:///week_2.db
Done.

[('Amanda', 53000, 'IT'),
 ('Gafar', 41000, 'IT'),
 ('Felix', 33000, 'IT'),
 ('Steve', 32000, 'Sales'),
 ('Bola', 31000, 'Sales'),
 ('Babalola', 30200, 'Sales')]

### Qs 3: Given the students table:

a. Write a query that creates a new column `percentage_score`.  The `percentage_score` is the mean of all the subjects for each student. Round the `percentage_score` to 2 decimal points and sort in descending order.

b. Write a query that selects **ONLY** the students that scored more than the mean of the `percentage_score`.

In [ ]:
# Write your solution here

%%sql

SELECT * FROM students

   sqlite:////content/week_2
   sqlite:///week_2
 * sqlite:///week_2.db
Done.

[('ux-012-013', 'Emeka', 'M', 95, 84, 94),
 ('ux-012-014', 'Agnes', 'F', 80, 69, 88),
 ('ux-012-015', 'Alimat', 'F', 69, 69, 77),
 ('ux-012-017', 'Fred', 'M', 28, 57, 39),
 ('ux-012-018', 'Ogechi', 'F', 80, 69, 78),
 ('ux-012-019', 'Steve', 'M', 61, 69, 72),
 ('ux-012-016', 'Esther', 'F', 93, 77, 91),
 ('ux-012-020', 'Ahmed', 'M', 87, 94, 85),
 ('ux-012-021', 'Samantha', 'F', 52, 69, 48),
 ('ux-012-022', 'Philip', 'M', 51, 39, 45),
 ('ux-012-023', 'Dave', 'M', 77, 69, 70),
 ('ux-012-024', 'Seyi', 'M', 54, 83, 63)]

In [ ]:
# Write your solution here

%%sql

SELECT matric_no, name, ROUND((maths+english+physics)/3, 2) AS percentage_score
FROM students
ORDER BY percentage_score DESC

   sqlite:////content/week_2
   sqlite:///week_2
 * sqlite:///week_2.db
Done.

[('ux-012-013', 'Emeka', 91.0),
 ('ux-012-020', 'Ahmed', 88.0),
 ('ux-012-016', 'Esther', 87.0),
 ('ux-012-014', 'Agnes', 79.0),
 ('ux-012-018', 'Ogechi', 75.0),
 ('ux-012-023', 'Dave', 72.0),
 ('ux-012-015', 'Alimat', 71.0),
 ('ux-012-019', 'Steve', 67.0),
 ('ux-012-024', 'Seyi', 66.0),
 ('ux-012-021', 'Samantha', 56.0),
 ('ux-012-022', 'Philip', 45.0),
 ('ux-012-017', 'Fred', 41.0)]

In [8]:
# Write your solution here

%%sql

SELECT matric_no, name, ROUND((maths+english+physics)/3, 2) AS percentage_score
FROM students
WHERE ROUND((maths+english+physics)/3, 2) > 
(SELECT AVG(ROUND((maths+english+physics)/3, 2))
FROM students)
ORDER BY percentage_score DESC

 * sqlite:///week_2.db
Done.

[('ux-012-013', 'Emeka', 91.0),
 ('ux-012-020', 'Ahmed', 88.0),
 ('ux-012-016', 'Esther', 87.0),
 ('ux-012-014', 'Agnes', 79.0),
 ('ux-012-018', 'Ogechi', 75.0),
 ('ux-012-023', 'Dave', 72.0),
 ('ux-012-015', 'Alimat', 71.0)]